tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/services"

# mac only
if OS.mac?
  tap "buo/cask-upgrade"
  tap "homebrew/cask"
  tap "homebrew/cask-fonts"
  tap "homebrew/cask-versions"
  tap "sanemat/font"
  brew "awscli"
  brew "blueutil"
  brew "iproute2mac"
  brew "ffmpeg"
  brew "libiconv"
  brew "mas"
end

tap "teamookla/speedtest"
brew "jpeg"
brew "libpng"
brew "openssl@1.1"
brew "autoconf"
brew "bat"
brew "bzip2"
brew "pkg-config"
brew "cmatrix"
brew "coreutils"
brew "curl"
brew "exa"
brew "fd"
brew "icu4c"
brew "gh"
brew "git-filter-repo"
brew "httpd"
brew "hub"
brew "oniguruma"
brew "jq"
brew "libedit"
brew "libxml2"
brew "libzip"
brew "peco"
brew "tidy-html5"
brew "php@8.0"
brew "procs"
brew "re2c"
brew "ripgrep"
brew "screenfetch"
brew "sl"
brew "starship"
brew "t-rec"
brew "translate-shell"
brew "tree"
brew "vim"
brew "wget"
brew "youtube-dl"
brew "zlib"
brew "zplug"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "teamookla/speedtest/speedtest"
cask "adobe-acrobat-reader"
cask "aerial"
cask "alfred"
cask "android-studio"
cask "audacity"
cask "bettertouchtool"
cask "cheatsheet"
cask "cleanshot"
cask "cyberduck"
cask "deepl"
cask "devtoys"
cask "discord"
cask "discord-canary"
cask "discord-ptb"
cask "docker"
cask "dropbox"
cask "duet"
cask "firefox"
cask "font-hackgen-nerd"
cask "font-ricty-diminished"
cask "google-chrome"
cask "google-chrome-beta"
cask "google-chrome-canary"
cask "google-drive"
cask "google-drive-file-stream"
cask "google-japanese-ime"
cask "imobie-m1-app-checker"
cask "iterm2"
cask "karabiner-elements"
cask "keyboardcleantool"
cask "kindle"
cask "licecap"
cask "microsoft-remote-desktop"
cask "multipass"
cask "notion"
cask "parallels"
cask "postman"
cask "slack"
cask "spotify"
cask "steam"
cask "tableplus"
cask "visual-studio-code"
cask "visual-studio-code-insiders"
cask "vivaldi"
cask "vlc"
cask "zoom"
mas "Bitwarden", id: 1352778147
mas "DaisyDisk", id: 411643860
mas "Developer", id: 640199958
mas "G App Launcher", id: 1543803459
mas "GarageBand", id: 682658836
mas "Hidden Bar", id: 1452453066
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Lightshot Screenshot", id: 526298438
mas "LINE", id: 539883307
mas "Microsoft Remote Desktop", id: 1295203466
mas "Notion Web Clipper", id: 1559269364
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "PopClip", id: 445189367
mas "Prime Video", id: 545519333
mas "Reeder", id: 1529448980
mas "RunCat", id: 1429033973
mas "Skitch", id: 425955336
mas "Spark", id: 1176895641
mas "TweetDeck", id: 485812721
mas "Twitter", id: 1482454543
mas "Xcode", id: 497799835
mas "xSearch", id: 1579902068
mas "Yoink", id: 457622435